Задание #1
Напишите программу которая находит агента с наивысшым медианным значением дохода по месяцам. (Количество агентов 10)
Для хранения данных использовать двумерный массив размером Nx12 (строка - это 12 значений заработка агента за каждый календарный месяц,
N - количество агентов).
Данные о доходе генерировать случайно в пределах от 1000 до 100000.
Учесть, что могут быть месяца, в которые агенты не работали. Либо еще не устроились на работу, либо уже уволились.
Такие месяца помечаются значением -1 и не учитываются при подсчете медианы.

Использовать функции для декомпозиции задачи.

Медиана, это так называемое значение "посередине". То есть такое значение,
что половина других значений меньше него, половина других - больше.
Если значений четное число, то медиана - это среднее значение двух значение "посередине"
Например, если имеется следующий набор данных: 10, 6, 2, 14, 7, 9, то два значения "посередине"
это 7 и 9. Среднее значение между 7 и 9 это 8 и есть медиана данного набора данных.
Необходимо учитывать, что агенты могут быть наняты или уволены в середине года.

Задание #2
Используя printf(...), <limits>, sizeof() cоставьте следующую таблицу

	Тип переменной		|    Размер,	|	        Значение             |  Количество
				|     байт    	|    Минимальное    |  Максимальное  | значимых бит
	----------------------------------------------------------------------------------------------			
	bool			|	       1|                  0|               1|	            1|
	unsigned short		|	       2|	           0|           65535|	           16|
	short
	unsigned int
	int
	unsigned long
	long
	unsigned long long
	long long
	char
	float
	double
для справки использовать http://www.cplusplus.com/reference/limits/numeric_limits/
и учебное пособие страницы 21-22
